FemDesign.Loads.PointLoad
point_load_type

FemDesign.Loads.PointLoad.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.PointLoad.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.String,FemDesign.Loads.ForceLoadType)
Internal constructor accessed by static methods.